# Parameter Type Id Rebar Shape Crank Start Straight Length Property

Source: https://www.revitapidocs.com/2026/6c99c151-bcc2-a489-5866-b4ecdc76597a.htm

---

| Parameter Type Id Rebar Shape Crank Start Straight Length Property |
| --- |

"Start Crank Straight Length"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankStartStraightLength { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankStartStraightLength As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankStartStraightLength {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankStartStraightLength : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace